app/views/to_dos/index.html.erb

	<% @projects.each do |project| %>
		<% if project.to_dos.length > 0 %>
---
SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."project_id" = ?  [["project_id", 1]]