app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Junk Corner"], ["created_at", 2016-08-18 23:54:33 UTC], ["updated_at", 2016-08-18 23:54:33 UTC]]
---
	def create
		puts params
		@project = Project.new(project_params)
		@project.save