app/controllers/to_dos_controller.rb

	def new
		@to_do = ToDo.new
		@projects =  Project.all
		@users = User.all
---
SELECT "projects".* FROM "projects"
SELECT "users".* FROM "users"

	def create
		@to_do = ToDo.new(to_do_params)

		if @to_do.save
---
INSERT INTO "to_dos" ("task", "created_at", "updated_at", "project_id", "user_id") VALUES (?, ?, ?, ?, ?)  [["task", "Clean the whiteboards"], ["created_at", 2016-08-23 04:44:46 UTC], ["updated_at", 2016-08-23 04:44:46 UTC], ["project_id", 8], ["user_id", 1]]

	def show
		@to_do = ToDo.find(params[:id])
---
SELECT  "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def index
		@projects = Project.all
		@to_dos = ToDo.all
---
SELECT "projects".* FROM "projects"
SELECT "to_dos".* FROM "to_dos"

	def destroy
		@to_do = ToDo.find(params[:id])
		@to_do.destroy
---
SELECT  "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "to_dos" WHERE "to_dos"."id" = ?  [["id", 1]]